[
  {
    "playerName": "blargh257",
    "character": "Fox",
    "notes": "– Recoginze when your combo is over and or when the combo is over. Dash Dance closer to my opponent \n– Clean up movement / recognize the situation you are in. Play the situation you are in and play it properly. You have to recognize that you are messing up and the results that stem from messing up. \n– Its fine to run off platform aerial but not fine to jump into it. Run off platform aerial is never reactable.\n— After uptilt work on shine immediately, turnaround grab, \n— Stop jabbing around 25\n—Right now I am wanting to engage immediately. If I just wake up dashback or roll away in the situation where blargh has setups i will not get hit.\n— after catching upair on the platform work on turnaround upsmash or grab\n— Stop doing early nairs – later nairs are just safer on shield. One good reason to do an early nair is if you are true whiff punishing someone, if you are reading someone jumping, or crossing someone up might be good reasons to early nair. \n— Upsmash grab at like 40ish (you should just intuitively know to grab in these places where you are doing double jc upsmash)\n—- mix up shield drop back air with shield empty land, sh off platform, sh off fall through plat, wavedash off land bair, wavedash off uptilt, empty land tomahawk, full hop to platform are all ideas to mix it up with. You could even shield drop nair low on shield and have frame advantage.\n— Be more intentional with the usage of fullhop. Recognize when you have a true punish. If you dont have a true punish, priotize disengagement (i/e empty full hop, full hop to the platform.)\n— Pay attention to everything that happens and why it happens. \n— make sure you recognize the spacing of the drill specifically on hit. \n— Ledgedash upair or ledgedash uptilt instead of ledgedash bair to cover platform\n— Be way more disciplined off the spawn platform and make sure that each attack makes sense.\n—from shield, wavedash back oos \n—stop bair at 0 – only drill shine and grab – there is no thought behind this. \n— dash forward after the launcher if you need it to combo. \n—every moment nothing happens tension builds. Right now im playing on the cadence where Im not waiting long enough for my opponent to feel said tension. Wait a few more beats. \n— Stop doing aerial from disadvantage \n- Pay attention to the fthrow mixup, this is where blargh tends to get the most of her low hanging fruit reversals in our sets.",
    "date": "2026-02-20T04:37:56.971Z"
  },
  {
    "playerName": "Ferociiti",
    "character": "Peach",
    "notes": "- Peach cant do anything about you going to top plat without having to do something relatively \n\n- After aerial dash away or shield  if you are in a spot where you think they can cc it. \n\n- Practice CCing all soft peach aerials(Unclepunch, important because I missed a free reversal)\n\n- Remove pressure that doesnt do anything \n\n- Stop giving up the whole stage – recognize when advantage leads to more advantage \n\n- Falling upair \n\n- Stop dashing off the platform towards peach to play invincibility \n",
    "date": "2026-02-20T04:29:14.943Z"
  },
  {
    "playerName": "Zeo",
    "character": "Captain Falcon",
    "notes": "- When trying to hit falcon, close more space or have frame advantage: if you dont have either of these things, you shouldn be trying to hit him.\n\n- Be aware of what the falcon's threat range is. For example, in zone 4 you can wavedash back out of falcon threat range but wavedashing in any point of his threat range you are dying to arbitrary aggression \n\n\n- Prepare to defend and play the mixup (attack in place, dash back, dash forward) after you confirm your opponent is SDIng the drill. \n\n- For catching falcon on the ground play close attention to frame advantage. Instead of having your baseline be im gonna run forward and figure it out later, you can just wavedash down to stop you from running forward. \n\n- Ask myself would the decision I made have earned a hit?\n\n- Stop wakeup shining falcon – pick different options: dash forward dash back hold shield, spotdodge DO NOT SHINE ON WAKEUP\n\n- There are cases in the corner where the falcon player is in terrible disadvantage where he is trying to defend himself – you don’t have to make a play here (this is the equivalent of waiting for the puff player to come back)\n\n- Falcon whiffing aerials doesnt do anything. He is just pressing buttons and you don’t have to interact with if it you do not want to.\n\n- Stop fullhopping. Fullhop is a read in this matchup. Fullhopping over him is a very specific read\n\n- There are cases where in the threat range you can wait and let him whiff. \n\n- Main rule for falcon: falcon has the burden of having to do things preemptively. You can wait for him to do something and act accordingly. Preemptively doing things is unwise. ",
    "date": "2026-02-20T04:27:50.699Z"
  },
  {
    "playerName": "Advice from Zamu (not player notes)",
    "character": "Fox",
    "notes": "- Play as if the opponent is the best at their respective opponent. You dont have to go up from there. \n\n- There’s merit in beating players the same way versus playing better people. It wont help you beat zain if you don't treat a worse marth like zain. \n\n- The goal isn't to beat your opponent but rather is to get better at the matchup. \n\n- If you are playing someone over and over and you are beating someone by beating them the same way over and over again. Stop playing that interaction, test them somewhere else.\n\n- How do I not get reversaled?\n- How do I take my advantage as far as possible?\n- Percent and CC\n\nI/e Cactuar game: What move can I do? \n\n-Be aware of the punish game that is about to occur but don’t queue up an action. If you recognize you are late, play an action after. When you do analysis of your own vods, look for where you miss kills and where you get killed. \n\n-Practice where you miss kills and get killed. These are the fast track options to getting really good. \n\n-Make a google drive notes for each character – what do I need to work on against this character? \n\n-Dont try to work on everything all at once. Pick very specific, and call yourself out if you see yourself stopping doing that. Play shorter sessions to be more intentional. \n\n-When Zamu plays someone way worse than her she does a lot worse, he’ll do way better against the good player because he's not trying to outplay the worse opponent. If your neutral game is strong it doesn't matter if you open them a lot, it doesn't matter if they are not afraid of you.\n\nIt doesn't matter if all you are getting is one hit if you call them out over and over. If you call them out and they are afraid of you\n\nPractice specific follow ups → take into account percent postion and DI. Don’t get distracted!\n\nUse custom DI feature in unclepunch!\n\nDon’t grabs rolls at the edge of the platform. If you throw fox on the platform, \n\nStart more with watching top players.\nMake sure your success rate on followups for the meaningful really hard things. \nThe process:\n\n1. Start off by doing the thing in the easiest way i/e waveshine upsmash on shiek\n2. Then move on to doing it from a standing shine.\n3. Then space it farther back\n\n\nThe List:\n\nPractice upthrow upsmash no di techcase and make sure to techchase. \n\nPractice with claw, and without claw for different situation, especially for techchasing with \n\nPractice waveshine upsmash on peach falcon sheik marth \n\nUpthrow upair on puff\n\n\n- The most important thing for decisionmaking and execution in any given situation in melee. Fully understand it, and it will be easier to look at. Learn each situation over and over again. \n\n- Play the RPS and then sprinkle everything else in.\n\n- There are other reasons why you should be beating people besides just adapting. \n\n- Practice aerial dashback because otherwise aerial shine / aerial isnt on your opponents mental stack \n\n- Stock lead means nothing in the ditto – percents matter a lot – stock leads only matter if the game goes to time and game never goes to time in fox dittos.\n\n- Percent matters if your opponent is higher than yours because if you just trade hits, you just win the game. Not necessarily what you want to be looking for, you want clean neutral because that situation is independent of the stock lead. \n\n- Make your opponent prove that you have to be the one to approach, but that is never the case because of laser (i/e peach puff). Think more about what are good positions to be in rather than I have a lead and that my opponent needs to approach or that I’m behind so I need to approach.\n\n- Make your opponent force you to have a reason to approach rather than be pressured by attrition.\n\n- Approach when you need to approach and dont approach when you dont need to\n\n- Take account of position and percent. \n\n- De group your fullhops (they are not grounded or actionable)\n\n- If your opponent is just existing and you are full hopping you are at a mild disadvantage.\n\n- Make sure each fullhop is individually fine and that you are not in fullhop mode. Have a good reason for each fullhop. \n\n- No reason to start drill high (unless you do fh drill and it combos on the ground) because you are aiming for your moves to hit and not whiff. By playing you either a: decrease disadvantage or b: find an advantage state\n\n- Attempt to always make decisions as humanly late as possible. Ideally every input you do should have been decided 15 frames before you do it. Kinda hard to do perfectly but what you should be aiming to do on a macro level.\n\n- Sometimes its okay to hold a good position and you dont have to attack. As soon as you do something punishable you are no longer in an advantage state and can die. Therefore if you wait while you are in advantage and force your opponent to initiate and lose. As long as I play patient in advantage the risk reward is skewed in my favor.\n\n- Replace giving up a lot of space to bait the opponent to move forward with aerial dashback or fullhop in place. \nIf you are trying to corner pressure an opponent, give up space but not enough space to stop threatening your opponent.\n\n- Don’t bait your opponent – it is a more inconsistent way to play the game rather than just playing the position in a more simple manner. Wait and screenlook because the opponent needs to fight out of the corner regardless. When you have frame advantage, you know your opponent has to do something because they are in more lag than you are. \n\n- Practice staying in whiff punishey range. Stop making hard reads they are just straight up bad risk reward. It is basically just a very hopeful guess. You have to have an exact read for that to be effective so instead play at whiff punish range. \n\n- Look for clean neutral wins where if the opponent does something you can punish and if you dont you are still generally in advantage \n\n- Each time you look for a hit ask yourself “did I have the prerequisite advantage to do the thing I did?” and also “did I deserve to get a hit here?” if you ask yourself this and you say no, you probably shouldn't be attacking. \n\n- Be more careful about your move choices “does this move lead to a punish?” “does this move get me punished?”\n\n- Stop giving opponents who are just waiting for free hits \n\n- You are putting yourself in good positions but then you attack out of them and lose out on the value. Work on waiting to captialize in these spots.\n\n- Start getting hit because you are not doing anything. When this happens, the opponent won the neutral game without getting a free hit, which is super duper sick. \n",
    "date": "2026-02-20T04:25:57.803Z"
  },
  {
    "playerName": "Rainy",
    "character": "Fox",
    "notes": "-Be ready to disengaged if you’re not ready for the next interaction i/e dj to plat. This kinda goes hand in hand with stopping forcing spots and playing good positions \n\n- Do more (empty) fullhop to check if shes gonna approach. If you get the urge to undershoot drill, instead either dashdance or empty fullhop to check the approach.\n \n- Especially off of the winning neutral with a forward throw you should face away at the ledge – encourages side b, which makes uptilt edgeguards much more reliable. If you think they are gonna side b, now you can cover it better.\n\n- Dont miss the punish on the tournament winner or you will get reversalled for trying to punish tournament. Punish tournament winner by reading either di in or di out. Try to hit them – (shine because it always knock down). Have a game plan to punish tournament winner is the main point. \n\n- Scout out dash back dash in jump out armada to cover jump back up b. Also, Rainy also doesnt cover jump back up b \n\n- Map out the forward throw mixup – what beats every mixup? Lots of foxes in norcal beat me really bad for this.\n\n\n-  Ledgedash uptilt is good if they are gonna do full hop aerial or unspaced aerials. Often time you just put yourself in lag and then sometimes you just play the normal interaction\n\n-  Stop approaching with drill. Doesnt work!\n\n-  Charge a tiny bit on the 90ish hard di out kill confirm with upthrow runcancel upsmash\n\n-  Fitzy says that you should go to top plat, deep breath on last stock so we can tap it in. On a similar note, slow down and refresh off the ledge for the edgeguard a little more often. Im a little too antsy and im missing the edgeguard timing. \n\n- Waveshine dashattack / uptilt dtilt / upsmash on reaction to missed tech and kill them (the cody schwab)\n\n- Fox Ditto Ideology (Fitzy) – Read short hops with full hops to cover options on reaction with drill. Catch them running at you with undershoot drills. \n\n- Fox Ditto Ideology(Adwan)– Hitting your edgeguards. Really hard for both foxes to actually hit each other, stalematey, when you go for openings you launch higher rewards options and gamble with approaches(run up grab, JC upsmash). Learn how to get the high risk high reward openings. \n\n- Fox Ditto ideology (Henry)\nLearn how the other fox plays in game and then figure out exactly what options you need to counter in game 2. Rainy is a sh nairer – uptilt, upsmash, dashback grab, asdi downer. \n\n- Be mentally down for neutral going on a long time because they (in this case rainy but applies to other foxes in norcal too) will freak out.\n\n- Fitzy says you should be more mindful at 0 percent (play like an asshole, evasive, fish for bair) -- how we find our leads in the ditto./\n\n- Stop drilling out of double jump – pure cheese. \n\n- Easiest ways to beat the bad foxes is to go second, but not last. Not that rainy is a bad fox but heuristically applicable. \n\nRelevant conversation between me and billy about how to fight foxes like rainy heuristically:\n\nbillybopeep:\n\nvs foxes like rainy the main gameplan ends up being playing for position\nif you can get into positions where yu have either space/the frame advantage then times where she would just nair forward really fast for example end up being spots where she hangs herself\nI dont think rainy would actually make any real reads on your defense so if you do things like transitioning to center stage when you have an unfavorable position, dash dancing and letting her whiff then having an option in mind you want to punish after she whiffs and just taking advantage of foxes good defensive tools in the ditto like CC and shield then it essentially completely removes the whole turn taking dynamic out of the mu\ni also specifically bring up CC and shield because doing things like drills in place or up tilts are committal enough to where you'll passively end up getting hit without making the other fox look for anything specific but CC and shield force the position where you have to specifically play around them if you dont want to get reversaled\nmmunder aka Megaman — 9:13 PM\nyeah because it hard counters the sh forward nairs\nbillybopeep — 9:13 PM\ntldr play for position, use shield and CC more often instead of moves in place as call outs, play for center stage and frame advantage\nbillybopeep — 9:13 PM\nyea its just a coin flip\nand it just lets them get lucky, and obviously if you really know you should just up smash it\nbut baseline just let them whiff then they're in frame disadvantage and you inherently have a lot of pressure\nmmunder aka Megaman — 9:15 PM\nFor sure this is perfect thank you so much there’s a lot to think about just with this information alone\nLooking forward to talking more about it  soon (sometime next week) I’ll try to get more games with lords of the clown nair where the biggest focus is looking at the screen well enough to present a: good frame off the cc or great frame advantage off of the sheild\n\n\n",
    "date": "2026-02-20T04:22:43.480Z"
  },
  {
    "playerName": "Techno / JAMEPS",
    "character": "Samus",
    "notes": "- Instead of fade forward bair fade back – this matter more than timing against samus\n\n- Dont try to back air samus — try to get her to get hit by it instead (she struggles with this)\n\n- Shield in the corner more often to check – dont hold shield just check\n\n- Replace lasers in neutral against missiles with movement and sometimes hitboxes \n\n- Get your one or two hits on samus and then play advantage state\n\n- Samus cannot catch fox. Therefore, Fox is winning when he has samus chasing her around.\n\n- Interacting with bomb is fake – ignore it and nothing will happen to you. Big Nothingburger move.\n\n- To deal with the falling aerial, you can upsmash it – simplify your sharking options (upair shark or upsmash shark)\n\n- When random things go wrong, fox is the one who pays for it – not samus. This is an important heuristic of the matchup.\n\n- If you are going to fade forward against samus – you probably have to be looking to space a drill]\n\n- Change intuition from drift into samus to either only drift in place or away\n\n- My gameplan isnt to laser against the floaties — its to avoid the character and hit the character\n\n- Fullhop less often and replace it with movement. This makes it harder for samus to do the air to air thing.\n\n- Dont drill uptilt against samus – drill shield or drill grab. They are holding down anyways!\n\n- Practice Sdi and Normal DI on fair, especially from the ledge.\n\n- Going ledge in the matchup isnt good unless you have full ledge invincibility and you know that samus up will not make it on to stage\n\n- Be less haphazard about the way you hit samus – you dont get random hits against her because shes only looking to reversal fox\n\n- Do more of the shield pokey downtilts -- can become a kill confirm\n\n- Dont wavedash oos against uptilt \n\n",
    "date": "2026-02-20T03:42:54.316Z"
  },
  {
    "playerName": "Denzill / Cozy ",
    "character": "Luigi",
    "notes": "- Almost always forward throw luigi — even if you decide to play reactively, you might kill him, which is not the case against the top tiers..\n\n- Nair uptilt is the only move that will hit luigi after hit confirming a nair\n\n- Pressure after a waveshine forwards shine hits – things to think about – run up grab, late nair, full hop.\n\n- If you shield against luigi in the air he cannot do ANYTHING except tomahawk grab, which you can roll out of the way due to being telegraphed. \n\n- Every Fullhop you do should be done with the intention of luigi drifting into YOU, rather than YOU drifting into luigi. If you do this wrong, you WILL get faired.\n\n- You can ONLY nair luigi when he is in the air. If you do it on the ground, something terrible will happen – whether he intends for it to happen or not. \n\n- Ignore luigi on the ground – its not that great to fight him UNLESS he's in the corner around the area where he gets knocked to ledge by shine. \n\n- Full hop nair in place – worth thinking about throwing out at higher percents \n\n- After ledgedash – consider an in place option during invinciblity. Options to think about – ledgedash dashback, ledgedash uptilt — luigi has to go out of his way to read these options a layer of two ahead – there is not a good way for luigi to apply pressure here if he is not reading it initially. \n\n- If you are going to go for a running and the shine hits, stop going for moves if you are going to dash forward, go for a grab – there’s a good chance itll connect if you are close enough\n\n- You can shield grab all of luigis aerials on shield \n\n-Things that can go wrong :\n\n1. Disrespecting luigi in the corner (i/e going for a shine that could get double jump faired or daired or coin spiked)\n\n2. Not properly pressuring luigi  \n\n3. Nairing when luigi is grounded (He will always CC this)\n\n4. Drifting at luigi with a fullhop (This is how he kills you a lot by anti airing you)\n\n5. Not grabbing after a running shine (Might as well grab here since the aforementioned EV on forward throw)\n\n6. Not sharking luigi with uptilt (If you can get below him and upair him it is SO bad for him)\n\n7. Being too grounded at low percents (easy for him to read tip and techchase you with wavedash downsmash)\n",
    "date": "2026-02-20T03:23:11.227Z"
  },
  {
    "playerName": "NMW / EspyColonThree",
    "character": "Captain Falcon",
    "notes": "***BIlly Notes***\n\n- Nick holds shield every time off the ledge so just grab him\n\n- Dash out of the way of nair1 and nair2 in zone1 (you always have to space around this nair as it is always reactable and hence never a mixup)\n\n- Practice Dash Dance Grabbing nair1 or nair2 – STOP WHIFF PUNISHING WITH NAIR AT CC%. (Whiff Punishing with nair is a LOT harder than whiff punishing with grab)\n\n- Whiff punish grab with your own grab (try this instead of whiff punishing with nair and getting cc grabbed, this info is also applicable with the notes from Tony versus Espy )\n\n- Don't jump or shine in scrambles -- works out better in falcons favor. Kinda similar idea with pressuring falcon. Pressuring falcon is scary because he can stomp you out of shield so do it properly if you are going to do it. Ideally, to pressure falcon you want to cross him up so you can space outside of his shield grab range (ideally behind him, still can land in front of him with but with less ev) - this is trying to avoid stomp oos and shield grab. Furthermore, pay way more attention to which way is facing -- want to know which way he is facing you or not facing you to cover the stomp oos with bair. Only situation when shine pressure is good is when you are in front of falcon and you arent spaced far enough to avoid the sheild grab. Empty hop and land and then play the mixup after instead of high bair pressure.\n\n\n- If you see people shielding, grab them for fucks sake – DONT NAIR THE SHEILD. Do the thing Preeminent talks about where you whiff punish them by setting a REACTION point to the shield and then grabbing it.\n\n- I need to focus on getting away and then hit after they whiff their invincibility. I also have to be more diligent about checking when I are actually out of the invincibility pressure and also more deliberate with changing invincibility patterns -- getting your invincibility patterns read by a falcon can be deadly because all he needs is one read on how you want to play out his invincibility to really screw you over.\n\n\n- Zone 2 3 and 4 need work – choose if you want to be close or if you want to be far. (For references to different zones, look at the falcon matchup section in the way of fox)\n\n- Don't try to make the first decision – this is where falcon is strongest because if you make the first choice then he doesn't have to commit first, which he is kind of banking on. Against falcon he can't easily hit you because of his slow jumps. This means your goal is to play in a way that makes falcon work for his openings. If you do thing preemptively, you are giving falcon an opportunity to interact with you, which is not what you want. If falcon can't interact with you, good – try to keep it that way. There will be times where you will have preemptively aerial, but that only occurs in zone one - when you are respecting unreactable run up grab. \n\n-Hit the one laser for the upsmash and then play neutral.\n\n- Grabs at low percents are bad unless you have to grab like a bad aerial. Follow ups to think about against falcon: Upthrow dash attack at 40. Upthrow fair at 80. \n\n- Practice hitting upthrow upsmash at 18% on all DIs on FD -- low hanging fruit punish stuff\n\n- Waveshine forward throw near the ledge when upsmash / grab dont work (18%).\n\n- Waveshine upsmash at 23% if you wanna make sure youre accounting for ASDI down tech in place\n\n- Wait till after the apex of falcons up b to charge smash attack if you plan to kill that way -- otherwise they can drift and it becomes annoying / bad if you whiff the smash attack\n\n- Make sure the options you have while edgeguarding falcon are flexible – because of the way he recovers, having invincibility means significantly less versus for example fox, be actionable above all. One way zuppy likes to do this is by rolling to the ledge and then taking a slight step forward to so you can both wavedash back to the ledge and also cover the apex if needed.\n\n***ZUPPY NOTES***\n\n- Tech in place vs. the techchasey falcon because tech in place and tech rolls dont rly matter. The big things that actually matter here are wake up shine and wake up shield in order to differentiate your defense. Especially against falcon, Missed Tech is bad cuz its covered by the tech in place options. \n\n- Worth assessing risks of techs, but if you tech to the corner and get read you get kneed and die. Sometimes its worth doing the more predictable thing, and then choosing a good defense option\n\n- To beat wizzy stomp, you prime yourself for it, dash dance grab, do a little pivot or dash back and grab it or upair\n\n- To beat run up grab at the unreactable distance, you gotta protect yourself, (full hop, nair in place, turn around bair in place,)\n\n- When falcon does the downsmash cheese at the ledge, you should just laser land and drop through aeiral\n\n- Anytime you wanna do a walling uptilt (not punish related, in true neutral) if you replace that uptilt with a bair with different drift it'll work out better)\n\n- If NMW is further, he goes for wizzy stomp or bair -- closer run up grab is his main approach. I keep getting grabbed cuz i dont have a good hitbox out to protect myself in that spot.\n\n- When you get falcon off stage dont forget about keeping yourself actionable -- you wanna be with your back to the ledge - stand in a spot where an fsmash would push you to the ledge. You dont wanna be exactly at the ledge. See last note in regards to edgeguarding.\n\n- On FD, you need to run to him but not too far, just far enough to box him out. \n\n- Zuppy Upthrow Flowchart: Wavedash or walk (setup) to where they are gonna land with their tech, and then upsmash the roll. If they tech in place you shine cuz reaction and damage. You wanna waveshine him to the corner and then upsmash him.\n\n- Waveshine once versus waveshine twice mixup is a tech lockout buffer, they cant input the tech every single time and hit it. \n\n\n***TONY (Preeminent) NOTES***\n- The roll to ledge bair tony saw, but he says i gotta do it more.\n\n-  Play a few falcon sessions focusing alot on grabbing them after they whiff and airial and shield and using dash dance upsmash. Tony says that I you got a really good dash dance you just almost always nair when you should be upsmashing.",
    "date": "2026-02-20T03:02:22.673Z"
  },
  {
    "playerName": "Phorox",
    "character": "Dr. Mario",
    "notes": "- The main thing against phorox is to stay composed and focused. Fiction calls doc a “focus check” matchup, which means its important not to rush things and give him free stuff like random hits / shield grabs / cc punishes / ftilts. This is a focus check matchup and you have been able to pass it in the past but usually in a best of three you tend to forget these things against him so these notes are there to remind us of that. You win neutral – it may be slow and grueling but as long as you dont panic and stuff the gameplan stuff below usually works pretty well\n\n- Don’t try to upthrow upair doc – you want to try to shark him once you have him in the air. This is kinda why bair and uptilt are the basis of the Phorox gameplan. OK to grab him but dont expect to actually get a combo without sharking the landing.\n\n- If he double jump pills full hop nair, he tends go into a “mode” where he does this especially if he feels like his opponent is better than him. \n\n- Otherwise wait dash dance hit the pill and shark with uptilt and bair whiff punish approach options\n\n- Once bair breaks tumble FH and sh bair become incredible zoning tools – try to approaching nair less than you might normally do against other people because its part of his main gameplan to try to sheildgrab specifically these.\n\n- Watch out for shield grab in the corner – it  leads to his backthrow cape charge fsmash flowchart. Make sure to sometimes airdodge during this and dont recover into him. He’s also pretty good about catching certain up b angles that other docs dont catch and caping the end of it so just something to be aware of. \n\n- Punish down b with drop fastfall shine shine when off stage\n\n- Watch out for ftilt and nair and up b cancel and fair as approach options – if these ever happen they are pretty reasonably easy to react to and stuff out. He WILL eventually feel pressured to do these things once you win neutral / attrition.\n",
    "date": "2026-02-20T02:30:23.643Z"
  },
  {
    "playerName": "Jhib",
    "character": "Falco",
    "notes": "- Louis says that you need to play the mixup after whiffing the fullhop aerial assuming that the falco can punish it, and that If i miss something be ready to do the mixup after.\n\n- After you whiff,  try to fast fall + full drift to give you more time to shield because it takes more time to get to you as a result\n\n- Doubleshine falco at the ledge as a read in the corner, react to if it works and if it doesnt, dont get punished for it.\n\n- Louis also says that you need to meaningfully staying grounded when you have them in disadvantage on the ground \n\n- Louis said I should replace drift full hop bair with just empty action (dash left, react) \n\n- Louis also says that you should Hit falco out of the air as hes rising either before or after but never. Trying to interact with the falco dair during this is a deathtrap and is usually what allows these kinds of approaches to work.  Dash back once to punish the “come down with dair” approach.\n\n- Biggest thing with Jhib is to clean up armada shines and be confident with the edgeguards because that's often where I've lost to him in the past\n \n\n",
    "date": "2026-02-20T02:16:50.112Z"
  },
  {
    "playerName": "Aerius",
    "character": "Marth",
    "notes": "***MEDZ SOLOS ANAYLSIS***\n- Biggest neutral opener that medz was using to catch aerius was run à slight fade forward sh drill from a pretty close distance. Besides running shine, this should be our baseline gameplan. On this note, Mixup running shine aerials more on top of the running shine aerials (start with mostly drill and then sometimes mix in nair in order to force them to respect us, and sometimes bair for platform pressure). Perhaps this is the answer I was looking for against like double downtilt in place? Have tried playing the mixup but honestly seems like its better to just not challenge it.\n\n- Do more getup upsmash or downsmash to edgeguard instead of getup attack marth after he does the up b mixup onto the stage .Gotta ASDI down up b under 13% and then start crouch canceling AFTER this percent because it sends at a sakurai angle at that percent.\n\n- Be ready to shield the down air after you upthrow upair him and he tries to SDI out and do said down air (he does this a lot).  He also sometimes does fair out of the SDIed upair so just be ready to shield that too. Might be worth it to sometimes just let yourself get hit by the dair and then tech in place shine as a mixup? Idk haven’t tested it that much but got it coincidentally against aerius in friendlies earlier.\n\n- Recognize after waveshine upsmash whether or not you actually can do an upair or if instead you should just be finishing the combo with a well timed bair that is hard for marth to reversal\n\n- Think about ledgedash turnaround uptilt to scout out dash dance grab.\n\n- Get better at holding out after the uptilt so you don’t get caught by ken combo. Medz makes it so hard for marth players to catch him holding in off stage.\n\n- On FD especially medz LOVES to do the hax edgeguard on marth where he read aerius doing the ultra super sweetspot to ledge with either run fullhop fastfall into a well timed shine. I should think about this one more, but I know it’s a hard read and you have to time it well otherwise you get clipped by the stage because of it inherently being a mixup. Medz says you should aim for the head and also to go behind the up b hitbox. it's a pretty hard read but also if it doesn't work you're totally safe and still have stage presence.\n\n- Once you find that initial drillshine upsmash is when you can be down to shoot a couple of lasers on FD because it’s a suggestion to your opponent that they should be taking space otherwise the current position your are in will be a losing one. Around 45 percent is when medz is doing this it feels like.\n\n- Keep it simple. Lots of waveshine upsmash. Don’t give Aerius the chance to interact early.\n\n- Do the drill In place NEVER do the full drift unless they dont have room to dashback – you have to switch it to in place \n\n***NOTES FROM VOD REVIEW WITH MEDZ***\n\n-One of the most important things that medz was talking to me about is doing some amount of drill>dash away. It keeps the marth hella honest and if they fail that test you can get away with it a lot. turns situations where you would otherwise be drilling in place (the answer for marth there is to do nothing) into an actual rps ish mixup. In a similar vein to the above post about drill dashback, - focus on whiff punishing and playing mixups that force him to whiff and maybe dash back himself. \n\n- Some options to consider in regards to potential panic options that marth might do when employing the above strategy: \n1. Instant up b \n2. Sheild grab \n3. Whiff nair\n4. Run up downtilt at 0 \n\n-Medz was telling me that I need to pay attention when I empty land off the platform – you can bait him here (i/e off the the fullhop off the platform. \n\n-I am doing everything a beat too late – see above about confidence and being in positon to whiff punish. We need to pay attention when we’re actually winning neutral – we just actually arent going in at the right timing after we get the clean ass neutral opening. On that same note, STOP DASHING BACK AFTER THEY WHIFF. \n\n\n- Medz was telling me that the second important idea is that I am actually usually already in position whiff punish AC nair when they are close enough – you are baiting him now DO something off the bait. Kinda goes back to the are you willing to gamble your life with playing the mixup on nair but also recognizing when the mixup has already been won and going to pound town off of it. Gotta be confident in these spots. \n\n- Medz was also stressing that I need to figure out the timing and then get under it running shine or dash dance or upsmash – pay attention whether or not hes doing full drift because that one is way more punish.\n\n- Medz was saying that Marths that do the instant up b typically are doing so to catch the initial start up of the roll for the marth killer. Aerius is one of these types of marths.\n\n-A couple of generic thoughts that Medz also had:\n1. Wake up shield in the corner more\n2.  I am also dashing away too much when i have him in the corner. Once we have him in the corner we play center and see whats up. No need to give up space on an advantageous position.\n3. Think more about shorthop shine if we are thinking about double jump aerial in the edgeguarding mixup tree.\n4.  If i dont confirm the drill, play the full hop dash away -- remember that ambiguity on spacing and frame advantage is where marth is king!\n\n\n***NOTES FROM BILLY***\n- At the start of the set, the reaction point should be wavedash into the downtilt when jeff starts the set with takes space with waveland --> downtilt\n\n- Set up marth doing dash forward short hop nair and practice spacing and getting a good dash timing\n\n- Don’t fuck with the nair timing UNLESS you are willing to bet your life that you will win the mixup\n\n- Once advantage proves to be uncertain as to if the hit will confirm its time to like slow down and not give him the reversal. \n\n- Drill on the ground, nair in the air, but the nair in the air catches them only when they are close on reaction otherwise its a mixup. The end result will be marth will be close to you by the time \n\n- Every time you dash forward against marth its your job to look at what hes doing and pick something on the fly. \n\n- Full drift forward drill isnt great unless they are literally right in front. \n\n- Stop shield dropping into the marth after marth drops the combo. Theres no advantageous button here. \n\n- Fox offense is picking timings to run forward presumptuous mixup range, and then midway through the mixup tree you might want to pick you begin to react to what is actually happening. You can decide to stop yourself early or fullhop but its important because theres no other way to super cleanly.\n\n- Wavedash down more – puts you in a concrete spot that you cant really achieve with dash dance. Wavedash down good for spacing and is good because it puts you in a specific spot where you have precise control of where you are. It also lets you be aggressive against marth in steps because you have to take your aggression in steps. You need to have frame advantage and you need to be close. This is a rule of the matchup and there is no breaking this. Marth comes out advantageous on ambiguous frame advantage and spacing. \n\n- When marth is in the corner, you dont have a reason to running shine because hes not gonna dash so it doesnt matter. Now the mixup becomes am i gonna stop here or am I gonna jump here. Figure out what timing you want to either nair or wavedash oos. \n\n***NOTES FROM AERIUS***\n\n- When im applying this stuff i might just get randomly grabbed but thats just growing pains when applying positional stuff – dont forgo how i play originally and slowly implement and play out the situations out with more intent. \n\n- Threaten marth off the ledge – he has fair downtilt or grab from the ledge and crouch beats everything except grab – once they think ur gonna cc everything you unlock the next.  Also threaten the most common option and see if they go for it – bait the jump or the side b and reset to an edgeguard where you can flowchart where. \n\n- More empty land instead of aerial when you know have him in disadvantage in the spot where hes behind you and in shield\n\n- Stop running shine people to the ledge in places where you know they are gonna slide off\n\n- Implement cc downsmash and cc shine to catch the low instant dolphin slash sweetspot. And for the instant high dolphin slash, you want to do a running shield to bait a early up b because they are afraid of instant attack, which puts them into a bad mixup. Getting a drill on marth means after the first rep you can can choose a defensive option\n\n- Instead of trying to punish a whiffed grab, if the timing looks difficult, do something that doesnt lose to holding down – the prominent example was dash → land over marth somehow (sh, dash through, etc)\n\n- If i think marth is going to do a move that dashes (grab or dash attack or fsmash), choose to either hold down or stuff the move with uptilt (or both)\n\n- More fh to bait an uptilt / anti air move which you can then whiff punish with drill or fastfall upair at percents where cc is broken \n\n- Stop fucking jabbing unless they are dashing back or jumping. You want to jab with a max wd in or jump \n\n- Run in and hold down if you see the marth player start to waveland until like 70% or 80% because only tipper will break cc, which means you get a free reversal or catch his movement \n\n- Change up how you get out of the corner on the plat. Sometimes if you’re on the side platform at like 0, you can stand still and marth has to play a mixup to figure out how to kill you from there. As fox, you can bait with a shield stop – they are gonna try to read what you are doing and you can get position that way. Don’t force yourself into the center, take inches not miles.\n\n- Mixup upthrow upair timing at 0% esp once he knows that im going for the default upair timing – go for either rising sh upair, or the latest possible upair to mixup the default upair timing. \n\n- ASDI down out of down air / fair reversals out of your upair if they sdi up and out and aerial. \n\n-Dont let marth do the good player drift back to ledge – play a mixup there sometimes. \n\n- Replace panic spotdodge will drill out of shield or roll or shine. Drill is the thing that gets you out of combos the most because it stuffs out an aggressive grounded option and you can control your drift like we talked about with medz.|\n\n-Think about more instant sh upair/ uptilt upsmash when you have marth shielding on the platform (essentially the same situation as marth would do to you)\n\n- After upthrow bair the mixup to the uptilt to shark them is to dash dance grab the fall aerial\n\n- Stop landing on the uptilt with a bair! Its gonna get cc grabbed! Whiff punish by going behind him instead! You should never be landing with a bair under like 70.\n\n- Read dash through or roll in from the corner.You can grab the dash through, or wait and uptilt the roll. \n",
    "date": "2026-02-20T02:09:27.439Z"
  },
  {
    "playerName": "Snap",
    "character": "Fox",
    "notes": "-We like big stages against snap because it is harder for him to setup his wincon of “only cheese you off stage and techchase like 20% of the time” – therefore we like FoD and DL\n\n-He is gonna try to check your firestall just be aware – might want to choose to go to top plat and light shield a little bit more \n\n-Dont get cheesed in the corner – fthrow, backthrow, running shine, generic shine chump checks are all part of his plan\n\n-Sometimes you need to platform camp / laser camp snap to stagger him \n\n-Once he has staggered he will eventually panic and go into sh nair or fh nair mode and at that point its ur job to dd grab them of cc the panic sh nair and shine it\n\n-Map out side b edgeguard decision tree more precisely\n (Poor pattern recognition / decision on my end, e.g repetitive instant dj out to cover side b which show misunderstanding of situation)\n\n-Think more about when the side b is fundamentally reactable vs when we have to position ourselves to play a mixup \n\n-Think about which 2 out of 3 we want to cover and how we can do that most safely (the way i decided to cover a side b from snap lost me the set)\n\n-Turnaround (threatens you potentially going to ledge) → changes what opponent is thinking, which makes them go usually slight above ledge height → react with uptilt OR preemptive fullhop to cover side b plat height. Sometimes can be covered by full hop instant back air.\n\n-Dont execution test ledgedash with upsmash (space outside with bair)\n\n-I keep also trying to force the issue with hard commitments under pressure \n\n-Remove unnecessary nair follow AFTER shine (replace with wavedash away) – enables a more meaningful followup because the nair after is disabling an actual followup\n\n-I hit someone and assume they are hittable again – LOOK at see what happens after you hit them instead! I should intuitively know \n\n-If they are nairing at us during the low% neutral fox ditto interactions focus on whiff punishing with dashback especially if they are doing it before it breaks CC / sends into tumble\n\n*** Billy notes from a snap set***\n- Spend a month to play slower and do everything deliberate and then go back to the normal speed when you have those decisions I would be a lot better. Sit down and think about how you want to hit fox while playing so that you can replace the shitty nairs you do with good choices. Don’t just hit the guy! How do I hit the guy\n- Get really at empty aerial into dashback → whiff punish \n\n- When you are in a really good position, that's the time you've earned to play more indirectly\n\n- If you play indirectly in a spot where you are not in a good position, that is where bad mixups happen\n\n - Spacing your grab – if you grab really deep where the grab hits point blank, you keep momentum and can get deeper grabs – this means running further before the jc grab!\n\n- Pick higher value punish options when they dont have resources when landing – imagine if someone double jumped in place on fd and you are just standing there what can they do to prevent you from hitting them? Nothing! They just have to fall.\n\n- Get better at the matchup indirectly – sometimes you need to let the fox hit themselves by messing up and running into you – you dont have to be the one that initiates\n\n\n- In last stock scrambles, more importantly than anything you need to take a step back and chill and be in the present to make an educated decision. \n\n- When things are weird, you should be able to understand if the situation is weird enough to be distracting – take a moment to collect yourself. \n\n- Top players will do small things that return the gamestate to normalcy – when they do that of course they are going to win because they are the better player. If top players gambled on these not normal situations they would be getting upset more often. \n\n- Be more specific in the ways you try to hit fox – specifically with percent advantage in mind. \n\n- Know when you are not playing your role right – what does this mean? Are you percent advantage right? Are you using the highest yield option based on what you have unlocked? \n\n",
    "date": "2026-02-20T01:38:35.734Z"
  }
]